# backend/test_data.py
TEST_QUESTIONS = [
    {
        "question": "การลากิจ ลูกจ้างจะขอลากิจได้ปีละกี่วัน และจะได้รับค่าจ้างในวันลากิจหรือไม่",
        "ground_truth": "วันลากิจ กฎหมายคุ้มครองแรงงานมิได้กำหนดไว้ว่านายจ้างจะจัดวันลากิจให้ลูกจ้าง กี่วันและจ่ายค่าจ้างให้ลูกจ้างหรือไม่ เพียงแต่กำหนดไว้ตามมาตรา 34 แห่งพระราชบัญญัติคุ้มครองแรงงาน พ.ศ. 2541 ความว่า ให้ลูกจ้างมีสิทธิลา เพื่อกิจธุระอันจำเป็นได้ตามข้อบังคับเกี่ยวกับการทำงาน"
    },
    {
        "question": "บริษัทจะหักค่าจ้างในวันที่ลูกจ้างไม่มาทำงานได้เป็นจำนวนเงินเท่าใด",
        "ground_truth": "เงินค่าจ้าง เป็นเงินที่นายจ้างจ่ายค่าตอบแทนสำหรับการทำงานของลูกจ้างในกรณีที่ลูกจ้าง ไม่มาทำงาน (ขาดงาน) นายจ้างไม่มีหน้าที่ต้องจ่ายค่าจ้างให้เท่าที่ลูกจ้างไม่มาทำงาน"
    },
    {
        "question": "บริษัทจะเลื่อนวันหยุดตามประเพณีในวันที่ 1 พฤษภาคม เนื่องจากมีงานด่วนจะทำได้หรือไม่และพนักงานให้ความยินยอมด้วยแล้ว",
        "ground_truth": "แม้พนักงานจะให้ความยินยอมให้บริษัทเลื่อนวันหยุด แต่หากบริษัทที่มิใช่เป็นงาน ในกิจการโรงแรม สถานมหรสพ ร้านขายอาหาร ร้านขายเครื่องดื่ม สโมสร สมาคม สถานพยาบาล สถานบริการ การท่องเที่ยว งานในป่า งานในที่ทุรกันดาร งานขนส่ง และงานที่มีลักษณะหรือสภาพของงานต้องทำติดต่อกันไปถ้าหยุดเสียหายแก่งานแล้ว บริษัทจะเลื่อนวันหยุดมิได้ หากบริษัทฯมีงานด่วนให้ลูกจ้างมาทำงานในวันที่ 1 พฤษภาคม ต้องได้รับความยินยอมจากลูกจ้างก่อนและต้องจ่ายค่าทำงานในวันหยุดให้กับ ลูกจ้างตามกฎหมาย"
    },
    {
        "question": "ลูกจ้างเพิ่งเข้ามาทำงานได้ 15 วัน หากลูกจ้างลาออกจากงานจะได้รับค่าจ้างหรือไม่",
        "ground_truth": "ลูกจ้างเข้าทำงานได้ 15 วัน หากลูกจ้างลาออกตามระเบียบของนายจ้าง ลูกจ้างจะได้รับค่าจ้าง 15 วัน เท่าที่ทำงาน และได้รับค่าจ้างเมื่อถึงกำหนดการจ่ายค่าจ้าง"
    },
    {
        "question": "บริษัทประกาศว่า หากพนักงานคนใดมาทำงานสายเกินกว่าครึ่งชั่วโมง จะหักค่าจ้างครึ่งวัน และหากมาทำงานสายเกินกว่าครึ่งวัน จะไม่จ่ายค่าจ้างในวันนั้นสามารถทำได้หรือไม่",
        "ground_truth": "การหักค่าจ้างของลูกจ้าง นายจ้างจะกระทำได้เฉพาะที่กฎหมายคุ้มครองแรงงานบัญญัติไว้ในมาตรา 76 เท่านั้น ยกตัวอย่าง เช่น หักเพื่อชำระภาษีเงินได้ ชำระค่าบำรุงสหภาพแรงงานฯ ชำระหนี้สินสหกรณ์ออมทรัพย์ฯ เป็นเงินประกัน เงินสะสมตามข้อตกลง โดยที่ลูกจ้างให้การตกลงยินยอมเป็นลายลักษณ์อักษร จากบทบัญญัติดังกล่าวไม่ได้ให้อำนาจนายจ้างในการลงโทษที่มาทำงานสายโดยการ หักค่าจ้างเลย ดังนั้นหากลูกจ้างมาทำงานสาย นายจ้างควรพิจารณาหามาตรการลงโทษตามระเบียบข้อบังคับการทำงานของบริษัทฯ ต่อไป และนายจ้างสามารถที่จะไม่จ่ายค่าจ้างให้กับลูกจ้างเท่าที่ลูกจ้างไม่ทำงาน ให้กับนายจ้าง"
    },
    {
        "question": "บริษัทเรียกเก็บเงินประกันได้ทุกตำแหน่งหรือไม่ หากเรียกเก็บเงินประกันได้จะเก็บได้เป็นเท่าใด",
        "ground_truth": "บริษัท ซึ่งเป็นนายจ้างเรียกเก็บเงินประกันจากลูกจ้างได้เฉพาะลักษณะหรือสภาพของงาน ที่ลูกจ้างทำนั้นต้องรับผิดชอบเกี่ยวกับการเงินหรือทรัพย์สินของนายจ้าง ซึ่งอาจก่อให้เกิดความเสียหายแก่นายจ้างได้ อันได้แก่ งานสมุห์บัญชี งานพนักงานเก็บและหรือจ่ายเงิน งานเฝ้าหรือดูแลสถานที่หรือทรัพย์สินของนายจ้าง หรือที่อยู่ในความรับผิดชอบของนายจ้าง งานติดตามหรือเร่งรัดหนี้สิน งานควบคุมหรือรับผิดชอบยานพาหนะ และงานที่มีหน้าที่รับผิดชอบในการซื้อขาย แลกเปลี่ยนให้เช่าทรัพย์ ให้เช่าซื้อ ให้กู้ยืม รับฝากทรัพย์ รับจำนอง รับจำนำ เก็บของในคลังสินค้า รับประกันภัย รับโอนหรือรับจัดส่งเงินหรือการธนาคาร ทั้งนี้ เฉพาะลูกจ้างซึ่งเป็นผู้ควบคุมเงินหรือทรัพย์สินเพื่อการนั้น กรณี ที่นายจ้างเรียกหรือรับเงินประกันจากลูกจ้างที่มีลักษณะหรือสภาพของงานตาม ที่กล่าวมาแล้วนั้น เงินประกันที่เรียกเก็บได้จะต้องไม่เกิน 60 เท่าของอัตราค่าจ้างรายวันโดยเฉลี่ยที่ลูกจ้างได้รับในวันที่นายจ้างรับเงิน ประกัน และต้องนำ เงินประกันที่รับจากลูกจ้างไปฝากไว้กับธนาคารพาณิชย์หรือสถาบันการเงินอื่น โดยจัดให้มีบัญชีเงินฝากของลูกจ้างแต่ละคน และแจ้งให้ลูกจ้างทราบด้วย"
    },
    {
        "question": "ลูกจ้างลาป่วยแต่ไม่มีใบรับรองแพทย์ ซึ่งระเบียบบริษัทฯ ให้ลูกจ้างยื่นใบรับรองแพทย์ด้วยจึงจะจ่ายค่าจ้างหากบริษัทฯไม่จ่ายค่าจ้าง เพราะลูกจ้างไม่มีใบรับรองแพทย์จะได้หรือไม่",
        "ground_truth": "สิทธิการลาป่วยของลูกจ้าง ลูกจ้างมีสิทธิลาป่วยได้เท่าที่ป่วยจริง หากลูกจ้างป่วยจริงและลาป่วยตั้งแต่ 3 วันทำงานขึ้นไปนายจ้างอาจให้ลูกจ้างแสดงใบรับรองแพทย์แผนปัจจุบันชั้นหนึ่ง หรือของสถานพยาบาลของทางราชการ หากลูกจ้างไม่อาจแสดงใบรับรองแพทย์ได้ ให้ลูกจ้างชี้แจงให้นายจ้างทราบ ค่าจ้างระหว่างการลาป่วย กฎหมายกำหนดให้นายจ้างจ่ายค่าจ้างให้แก่ลูกจ้าง ในวันลาป่วยตามวรรคหนึ่งเท่ากับอัตราค่าจ้างในวันทำงานตลอดระยะเวลาที่ลา ป่วย ปีหนึ่งไม่เกิน 30 วันทำงาน"
    },
    {
        "question": "วันหยุดตามประเพณีแต่ละปีๆ หนึ่งต้องจัดให้มีวันหยุดกี่วัน วันใดบ้าง จำเป็นต้องเหมือนกันทุกๆ ปีหรือไม่ และต้องจ่ายค่าจ้างในวันหยุดให้ลูกจ้างรายวันด้วยหรือไม่",
        "ground_truth": "นายจ้างต้องประกาศกำหนดวันหยุดตามประเพณีให้ลูกจ้างทราบเป็นการล่วงหน้าปี หนึ่งไม่น้อยกว่าสิบสามวันโดยรวมวันแรงงานแห่งชาติด้วย ส่วนจะเป็นวันใดบ้างให้นายจ้างพิจารณาจากวันหยุดราชการประจำปี วันหยุดทางศาสนา หรือขนบธรรมเนียมประเพณีท้องถิ่น วันหยุดตามประเพณีไม่จำเป็นต้องเหมือนกันทุกปีอยู่ที่ดุลยพินิจของนายจ้าง ด้วย กรณีค่าจ้างในวันหยุดตามประเพณีนายจ้างต้องจ่ายค่าจ้างให้แก่ลูกจ้างตามปกติ ไม่ว่าจะเป็นลูกจ้างรายเดือนหรือลูกจ้างรายวัน"
    },
    {
        "question": "บริษัทจะจ้างลูกจ้างเด็กเข้าทำงานได้หรือไม่",
        "ground_truth": "กฎหมายกำหนดมิให้นายจ้างจ้างเด็กอายุต่ำกว่าสิบห้าปีเป็นลูกจ้าง แต่ในกรณีที่มีการจ้างเด็กอายุต่ำกว่าสิบแปดปีเป็นลูกจ้าง นายจ้างจะต้องปฏิบัติให้ถูกต้องตามกฎหมายกำหนด เช่น ต้องแจ้งการจ้างลูกจ้างเด็กต่อพนักงานตรวจแรงงานภายในสิบห้าวันนับแต่วันที่ เด็กเข้าทำงาน ต้องจัดทำบันทึกสภาพการจ้างกรณีที่มีการเปลี่ยนแปลงไปจากเดิมเก็บไว้ ณ สถานประกอบกิจการและแจ้งการสิ้นสุดการจ้างลูกจ้างเด็กต่อพนักงานตรวจแรงงาน ภายในเจ็ดวันนับแต่วันที่เด็กออกจากงาน"
    },
    {
        "question": "นายจ้างให้เด็กซึ่งตามพ่อแม่มาทำงานในกรุงเทพฯ ทำงานช่วยพ่อแม่โดยจ่ายค่าจ้างให้วันละ 150 บาท และจะหักเงินประกันลูกจ้างเด็กได้หรือไม่",
        "ground_truth": "ประกาศกระคณะกรรมการค่าจ้าง เรื่อง อัตราค่าจ้างขั้นต่ำ ฉบับที่ 3 ลงวันที่ 25 ธันวาคม 2552 กำหนดให้ท้องที่กรุงเทพมหานครจ่ายค่าจ้างให้ลูกจ้างวันละ 206 บาท ดังนั้น นายจ้างจะจ่ายค่าจ้างให้ลูกจ้างที่เป็นผู้ใหญ่หรือเด็กวันละ 150 บาทไม่ได้ และตามมาตรา 51 แห่งพระราชบัญญัติคุ้มครองแรงงาน พ.ศ. 2541 ห้ามมิให้นายจ้างเรียกหรือรับหลักประกันจากลูกจ้างซึ่งเป็นเด็ก"
    },
    {
        "question": "นายจ้างจ่ายเงินโบนัสประจำปีน้อยกว่าปีก่อนๆ จะทำอย่างไร",
        "ground_truth": "ต้องดูว่ามีข้อตกลงเกี่ยวกับสภาพการจ้างเรื่องการจ่ายโบนัสไว้หรือไม่อย่าง ไร หากไม่มีข้อตกลงเกี่ยวกับสภาพการจ้างเรื่องนี้ไว้ นายจ้างก็มีสิทธิที่จะกำหนดการจ่ายโบนัสประจำปีให้กับลูกจ้างได้ แต่หากมีข้อตกลงเกี่ยวกับสภาพการจ้างในเรื่องการจ่ายโบนัส นายจ้างต้องจ่ายตามข้อตกลงนั้น หากจ่ายน้อยกว่าที่ตกลงกันไว้ ถือเป็นการเปลี่ยนแปลงสภาพการจ้างต้องได้รับความยินยอมจากลูกจ้างก่อน"
    },
    {
        "question": "วันหยุดตามประเพณีใน 1 ปี จัดให้มีวันหยุดกี่วัน วันใดบ้าง จำเป็นต้องเหมือนกันทุกๆ ปีหรือไม่ และต้องจ่ายค่าจ้างในวันหยุดให้ลูกจ้างรายวันด้วยหรือไม่",
        "ground_truth": "นายจ้างต้องประกาศกำหนดวันหยุดตามประเพณีให้ลูกจ้าง ทราบเป็นการล่วงหน้าปีหนึ่งไม่น้อยกว่าสิบสามวันโดยรวมวันแรงงานแห่งชาติ ด้วย ส่วนจะเป็นวันใดบ้างให้นายจ้างพิจารณาจากวันหยุดราชการประจำปี วันหยุดทางศาสนา หรือขนบธรรมเนียมประเพณีท้องถิ่น วันหยุดตามประเพณีไม่จำเป็นต้องเหมือนกันทุกปีอยู่ที่ดุลยพินิจของนายจ้าง ด้วย กรณีค่าจ้างในวันหยุดตามประเพณีนายจ้างต้องจ่ายค่าจ้างให้แก่ลูกจ้างตามปกติ ไม่ว่าจะเป็นลูกจ้างรายเดือนหรือลูกจ้างรายวัน"
    },
    {
        "question": "บริษัทจะเลื่อนวันหยุดตามประเพณีในวันที่ 1 พฤษภาคม เนื่องจากมีงานด่วนจะทำได้หรือไม่ โดยพนักงานให้ความยินยอมด้วยแล้ว",
        "ground_truth": "แม้พนักงานจะให้ความยินยอมให้บริษัทเลื่อนวันหยุด แต่หากบริษัทที่มิใช่เป็นงานในกิจการโรงแรม สถานมหรสพ ร้านขายอาหาร ร้านขายเครื่องดื่ม สโมสร สมาคม สถานพยาบาล สถานบริการ การท่องเที่ยว งานในป่า งานในที่ทุรกันดาร งานขนส่ง และงานที่มีลักษณะหรือสภาพของงานต้องทำติดต่อกันไปถ้าหยุดเสียหายแก่งานแล้ว บริษัทจะเลื่อนวันหยุดมิได้ หากบริษัทฯ มีงานด่วนให้ลูกจ้างมาทำงานในวันที่ 1 พฤษภาคม ต้องได้รับความยินยอมจากลูกจ้างก่อนและต้องจ่ายค่าทำงานในวันหยุดให้กับ ลูกจ้างตามกฎหมาย"
    },
    {
        "question": "ในกรณีที่วันหยุดตาม ประเพณีตรงกับวันหยุดประจำสัปดาห์ จะเลื่อนไปหยุดชดเชยในวันอื่นที่ไม่ใช่วันทำงานถัดไปได้หรือไม่ หากไม่ได้ ถ้าลูกจ้างเป็นผู้ร้องขอจะทำได้หรือไม่",
        "ground_truth": "ตามกฎหมายปัจจุบันต้องไปหยุดในวันทำงานถัดไป แต่มีข้อยกเว้นตามกฎกระทรวงที่ลักษณะของงานที่อยู่ในกฎกระทรวงว่าลักษณะงาน นั้นจะหยุดชดเชยในวันใดก็ได้ หรือให้นายจ้างจ่ายค่าล่วงเวลาหรือค่าทำงานในวันหยุดก็ได้ แต่เฉพาะงานที่กำหนดไว้ในกฎกระทรวงเท่านั้น นอกจากนั้นต้องไปหยุดชดเชยในวันทำงานถัดไปเท่านั้น ซึ่งถ้าไม่หยุดก็ต้องจ่ายเป็นค่าทำงานในวันหยุด"
    },
    {
        "question": "บริษัทให้พนักงานมีวัน หยุดพักผ่อนตามกฎหมายปีละ 6 วันทำงาน พนักงานเข้าทำงานวันที่ 1 เมษายน 2542 ถึงวันที่ 1 สิงหาคม 2543 เขาจะมีสิทธิหยุดพักผ่อนประจำปีได้กี่วัน",
        "ground_truth": "หลักในเรื่องนี้ขอให้ยึดหลักวันชนวัน เดือนชนเดือน พอครบ 1 ปีบริบูรณ์(ก็คือวันแรกของต้นปีที่สอง) พนักงานจะมีสิทธิหยุดพักผ่อนได้ทันที 6 วัน ส่วนวันหยุดพักผ่อนในช่วงปีที่สองนั้น ลูกจ้างไม่จำเป็นต้องทำงานให้ครบอีก 1 ปี ปีที่สองลูกจ้างมีสิทธิหยุดหรือนายจ้างต้องจัดให้ลูกจ้างเมื่อรวมกับ 6 วันแรกที่ยังไม่ได้หยุดแล้วเท่ากับ 12 วัน ซึ่งหมายถึงถ้านับวันแรกเข้าทำงานจนถึงครบ 2 ปีบริบูรณ์ ลูกจ้างมีสิทธิหยุดพักผ่อน 12 วันทำงาน ดังนั้นสิทธิ์ของปีที่สองจึงเกิดขึ้นทันทีตั้งแต่วันต้นปีที่สองจนถึงวันสุด ท้ายของปีที่สอง"
    }
]